{
  "posts": [
    {
      "title": "RCOS meeting notification",
      "body": "Hi Kevin! Here is a message from the RCOS announcements-- I am trying to make sure everyone gets the message, so they know the plan! please thumbs up this message when you see it :微笑的脸:\n------\nWe DO plan to meet this Tuseday 07/06 at 4:00pm to do some work. Please try your best to attend, and if you are unable to make it please message me or one of the leads! I know and understand this is your break, but we would like to get as much work done as possible by the weekend of 07/10 and 07/11.\nDue to this scheduling, we plan to give you guys a break during the week of 07/12! In other words, we will NOT be meeting on 07/13 or 07/16 :微笑的脸:",
      "publishedAt": "2021-07-14",
      "id": 1
    },
    {
      "body": "Successfully implemented the login function",
      "title": "Successfully implemented the login function",
      "publishedAt": "2021-07-27",
      "id": 2
    },
    {
      "body": "Hi Kevin! With respect to the functions for the admin/moderator dashboard, we are thinking that it should have the following functions:\neach moderator will a groupchat with a certain number of users (TBD depending on the number of users playing a game)\nusers will have a “call for assistance” button that they can click on, and a moderator will be alerted + can teleport into the room with the user that clicked the button\nspeaking and chatting function with other moderators\na “request project lead” button that will immediately contact a project lead--> directs them to a page with project lead phone number(s) (numbers TBD)\nmoderators will have a list of tasks that the users must complete for points\nassociated with this list, there will be a certain number of points moderators can award to teams (points moderators can select: 1, 2, 3, 4, 5)\nthe system will automatically assign users tasks--> the system will message both the moderators and students the list of tasks\nThis is all we have for now, but if we think of anything else, I will message you with more details! Best of luck and let us know if you have any questions! Thank you Kevin! ",
      "title": "Jobs",
      "publishedAt": "",
      "id": 3
    }
  ],
  "users": [
    {
      "name": "Peiru Liu",
      "email": "liup5@rpi.edu",
      "id": 1
    }
  ]
}